-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2026-01-14 03:20:08
-- サーバのバージョン： 10.4.32-MariaDB
-- PHP のバージョン: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `festival`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `detail`
--

CREATE TABLE `detail` (
  `d_id` int(11) NOT NULL,
  `si_id` int(11) NOT NULL,
  `s_id` int(11) NOT NULL,
  `num` int(11) NOT NULL,
  `price` int(11) NOT NULL,
  `disc` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `detail`
--

INSERT INTO `detail` (`d_id`, `si_id`, `s_id`, `num`, `price`, `disc`) VALUES
(1, 1, 0, 2, 100, 0),
(2, 1, 0, 2, 100, 0),
(3, 1, 0, 2, 100, 0),
(4, 1, 0, 2, 100, 0),
(5, 1, 0, 2, 100, 0),
(6, 2, 0, 4, 100, 0),
(7, 1, 0, 2, 100, 0),
(8, 2, 0, 4, 100, 0);

-- --------------------------------------------------------

--
-- テーブルの構造 `item`
--

CREATE TABLE `item` (
  `i_id` int(11) NOT NULL,
  `i_name` varchar(40) NOT NULL,
  `i_price` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `item`
--

INSERT INTO `item` (`i_id`, `i_name`, `i_price`) VALUES
(1, 'ベースドリンク', 50),
(2, 'ドリンクトッピング', 25),
(3, '焼きそば', 50),
(4, 'フランクフルト', 100),
(5, 'おでん1個', 50),
(6, 'からあげ3個', 100),
(7, 'カレーうどん', 100),
(14, 'おやつ', 250),
(15, 'きゃべつ', 250);

-- --------------------------------------------------------

--
-- テーブルの構造 `reserve`
--

CREATE TABLE `reserve` (
  `r_id` int(11) NOT NULL,
  `d_id` datetime(6) NOT NULL DEFAULT current_timestamp(6),
  `st_id` int(11) NOT NULL,
  `s_id` int(11) NOT NULL,
  `num` int(11) NOT NULL,
  `situation` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `reserve`
--

INSERT INTO `reserve` (`r_id`, `d_id`, `st_id`, `s_id`, `num`, `situation`) VALUES
(1, '2026-01-09 11:49:58.000000', 2470101, 1, 3, 0),
(2, '2026-01-09 11:51:45.000000', 2470107, 4, 2, 1);

-- --------------------------------------------------------

--
-- テーブルの構造 `sales`
--

CREATE TABLE `sales` (
  `s_id` int(11) NOT NULL,
  `s_date` datetime NOT NULL DEFAULT current_timestamp(),
  `sh_id` int(11) NOT NULL,
  `situation` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `sales`
--

INSERT INTO `sales` (`s_id`, `s_date`, `sh_id`, `situation`) VALUES
(1, '2026-01-09 11:43:49', 1, 1),
(2, '2026-01-09 11:43:19', 2, 2);

-- --------------------------------------------------------

--
-- テーブルの構造 `shop`
--

CREATE TABLE `shop` (
  `sh_id` int(11) NOT NULL,
  `fy` int(11) NOT NULL,
  `class` varchar(6) NOT NULL,
  `pr_name` varchar(40) NOT NULL,
  `place` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `shop`
--

INSERT INTO `shop` (`sh_id`, `fy`, `class`, `pr_name`, `place`) VALUES
(1, 2025, 'R4A1', 'ドリンク体験', '3階フロア'),
(2, 2025, 'R3A1', '焼きそば', '中庭'),
(3, 2025, 'R2A1', 'フランクフルト', '503'),
(4, 2025, 'R1A1', 'おでん', '中庭'),
(5, 2025, 'R1A2', 'からあげ', '中庭'),
(6, 2025, 'S3A1', 'カレーうどん', '中庭'),
(7, 2025, 'S1A1', 'フライドポテト', '中庭'),
(8, 2025, 'J2B1', 'カフェ', '701'),
(9, 2025, 'J1A1', 'ワッフル', '5階フロア'),
(10, 2025, 'G3A1', '白玉団子', '中庭'),
(11, 2025, 'G1A1', 'たこ焼き', '4階フロア');

-- --------------------------------------------------------

--
-- テーブルの構造 `shopitem`
--

CREATE TABLE `shopitem` (
  `s_id` int(11) NOT NULL,
  `sh_id` int(11) NOT NULL,
  `item_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `shopitem`
--

INSERT INTO `shopitem` (`s_id`, `sh_id`, `item_id`) VALUES
(1, 1, 1),
(2, 2, 2);

-- --------------------------------------------------------

--
-- テーブルの構造 `student`
--

CREATE TABLE `student` (
  `st_id` int(11) NOT NULL,
  `class` char(4) NOT NULL,
  `name` varchar(20) NOT NULL,
  `kana` varchar(20) NOT NULL,
  `pasc` char(6) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `student`
--

INSERT INTO `student` (`st_id`, `class`, `name`, `kana`, `pasc`) VALUES
(2270101, 'R4A1', '石塚　雅博', 'イシヅカ　マサヒロ', '237481'),
(2270102, 'R4A1', '岩田　亜矢子', 'イワタ　アヤコ', '262527'),
(2270103, 'R4A1', '大下　和枝', 'オオシタ　カズエ', '818027'),
(2270104, 'R4A1', '児島　心音', 'コジマ　ココネ', '236159'),
(2270105, 'R4A1', '園田　心美', 'ソノダ　ココミ', '969489'),
(2270106, 'R4A1', '寺崎　悠', 'テラサキ　ハルカ', '906129'),
(2270107, 'R4A1', '長井　昭三', 'ナガイ　ショウゾウ', '360013'),
(2270108, 'R4A1', '早川　武矢', 'ハヤカワ　タケヤ', '226751'),
(2270109, 'R4A1', '平原　一也', 'ヒラハラ　カズヤ', '439555'),
(2270110, 'R4A1', '矢吹　功一', 'ヤブキ　コウイチ', '216886'),
(2340101, 'S3A1', '加瀬　紗弥', 'カセ　サヤ', '326981'),
(2340102, 'S3A1', '金丸　香澄', 'カナマル　カスミ', '498932'),
(2340103, 'S3A1', '古賀　優依', 'コガ　ユイ', '756471'),
(2340104, 'S3A1', '桜井　光希', 'サクライ　ミツキ', '315294'),
(2340105, 'S3A1', '津田　広吉', 'ツダ　ヒロキチ', '812081'),
(2340106, 'S3A1', '露木　秀加', 'ツユキ　ヒデカ', '575333'),
(2340107, 'S3A1', '長島　謙三', 'ナガシマ　ケンゾウ', '251677'),
(2340108, 'S3A1', '平野　桜子', 'ヒラノ　サクラコ', '126724'),
(2340109, 'S3A1', '矢田　結香', 'ヤダ　ユイカ', '173927'),
(2340110, 'S3A1', '山川　日菜乃', 'ヤマカワ　ヒナノ', '383832'),
(2360101, 'G3A1', '石倉　竹男', 'イシクラ　タケオ', '709135'),
(2360102, 'G3A1', '大村　晴香', 'オオムラ　ハルカ', '275419'),
(2360103, 'G3A1', '関　奈保', 'カン　ナホ', '131830'),
(2360104, 'G3A1', '笹川　安男', 'ササガワ　ヤスオ', '568120'),
(2360105, 'G3A1', '沢村　奏音', 'サワムラ　カノン', '138140'),
(2360106, 'G3A1', '杉野　寧音', 'スギノ　ネネ', '869921'),
(2360107, 'G3A1', '高岡　里穂', 'タカオカ　リホ', '316814'),
(2360108, 'G3A1', '谷川　詠一', 'タニガワ　エイイチ', '582214'),
(2360109, 'G3A1', '中川　寅男', 'ナカガワ　トラオ', '224859'),
(2360110, 'G3A1', '長野　貞行', 'ナガノ　サダユキ', '809257'),
(2370101, 'R3A1', '阿久津　一望', 'アクツ　ヒトミ', '629199'),
(2370102, 'R3A1', '有田　弘美', 'アリタ　ヒロミ', '996212'),
(2370103, 'R3A1', '安藤　久美子', 'アンドウ　クミコ', '298768'),
(2370104, 'R3A1', '石川　常夫', 'イシカワ　ツネオ', '276042'),
(2370105, 'R3A1', '石渡　敏嗣', 'イシワタリ　トシツグ', '405540'),
(2370106, 'R3A1', '市原　卓雄', 'イチハラ　タクオ', '274656'),
(2370107, 'R3A1', '井原　絢菜', 'イハラ　アヤナ', '759652'),
(2370108, 'R3A1', '梅津　裕子', 'ウメヅ　ヒロコ', '412045'),
(2370109, 'R3A1', '大澤　一弘', 'オオサワ　カズヒロ', '565922'),
(2370110, 'R3A1', '奥野　範明', 'オクノ　ノリアキ', '463771'),
(2370111, 'R3A1', '木村　朋子', 'キムラ　トモコ', '218161'),
(2370112, 'R3A1', '楠　勇', 'クスノキ　イサミ', '378805'),
(2370113, 'R3A1', '高田　詩乃', 'コウダ　シノ', '303785'),
(2370114, 'R3A1', '重松　富士雄', 'シゲマツ　フジオ', '477874'),
(2370115, 'R3A1', '谷口　怜', 'タニグチ　レイ', '934070'),
(2370116, 'R3A1', '中村　梨緒', 'ナカムラ　リオ', '918155'),
(2370117, 'R3A1', '浜口　貞雄', 'ハマグチ　サダオ', '713013'),
(2370118, 'R3A1', '平山　謙多郎', 'ヒラヤマ　ケンタロウ', '690807'),
(2370119, 'R3A1', '堀江　和島', 'ホリエ　ワジマ', '251443'),
(2370120, 'R3A1', '本山　喜代', 'モトヤマ　キヨ', '484569'),
(2440101, 'S2A1', '宇佐美　春彦', 'ウサミ　ハルヒコ', '840435'),
(2440102, 'S2A1', '梅村　勝利', 'ウメムラ　カツトシ', '940342'),
(2440103, 'S2A1', '小嶋　慎一郎', 'オジマ　シンイチロウ', '120261'),
(2440104, 'S2A1', '滋賀　敏之', 'シガ　トシユキ', '102704'),
(2440105, 'S2A1', '島崎　憲司', 'シマザキ　ケンジ', '716213'),
(2440106, 'S2A1', '須賀　絢子', 'スガ　アヤコ', '553909'),
(2440107, 'S2A1', '寺岡　陽向', 'テラオカ　ヒナタ', '966547'),
(2440108, 'S2A1', '内藤　姫乃', 'ナイトウ　ヒメノ', '608383'),
(2440109, 'S2A1', '畠中　百花', 'ハタナカ　モモカ', '994468'),
(2440110, 'S2A1', '平本　美甘', 'ヒラモト　ミカン', '983785'),
(2460111, 'G2A1', '上野　文子', 'アガノ　アヤコ', '983274'),
(2460112, 'G2A1', '岩井　武一', 'イワイ　タケイチ', '904742'),
(2460113, 'G2A1', '江原　佳桜', 'エバラ　カオ', '980760'),
(2460114, 'G2A1', '風間　彼方', 'カザマ　カナタ', '914016'),
(2460115, 'G2A1', '小平　礼悠', 'コダイラ　アヤチカ', '519545'),
(2460116, 'G2A1', '阪本　朱里', 'サカモト　アカリ', '116640'),
(2460117, 'G2A1', '杉浦　栞', 'スギウラ　シオリ', '407367'),
(2460118, 'G2A1', '鈴木　重男', 'スズキ　シゲオ', '637235'),
(2460119, 'G2A1', '寺本　砂登子', 'テラモト　サトコ', '796858'),
(2460120, 'G2A1', '室井　孝利', 'ムロイ　タカトシ', '217035'),
(2470101, 'R2A1', '有田　澪', 'アリタ　ミオ', '724719'),
(2470102, 'R2A1', '石岡　菊男', 'イシオカ　キクオ', '894551'),
(2470103, 'R2A1', '石坂　貞', 'イシザカ　サダ', '945652'),
(2470104, 'R2A1', '植村　絢香', 'ウエムラ　アヤカ', '192249'),
(2470105, 'R2A1', '江成　吉之助', 'エナリ　キチノスケ', '922864'),
(2470106, 'R2A1', '小嶋　葉子', 'オジマ　ヨウコ', '731731'),
(2470107, 'R2A1', '川口　真緒', 'カワグチ　マオ', '187395'),
(2470108, 'R2A1', '川畑　志乃', 'カワバタ　シノ', '757703'),
(2470109, 'R2A1', '須藤　奈津美', 'スドウ　ナツミ', '787867'),
(2470110, 'R2A1', '田島　博明', 'タジマ　ヒロアキ', '511057'),
(2470111, 'R2A1', '津田　充照', 'ツダ　ミツテル', '374828'),
(2470112, 'R2A1', '徳田　有美', 'トクダ　ユミ', '318014'),
(2470113, 'R2A1', '戸塚　康博', 'トツカ　ヤスヒロ', '953450'),
(2470114, 'R2A1', '長友　邦子', 'ナガトモ　クニコ', '380293'),
(2470115, 'R2A1', '長谷　栞', 'ナガヤ　シオリ', '978551'),
(2470116, 'R2A1', '広川　千鶴', 'ヒロカワ　チヅル', '843218'),
(2470117, 'R2A1', '堀田　葵伊', 'ホッタ　アオイ', '136873'),
(2470118, 'R2A1', '前川　佳奈子', 'マエカワ　カナコ', '741649'),
(2470119, 'R2A1', '森島　三枝子', 'モリシマ　ミエコ', '185724'),
(2470120, 'R2A1', '横尾　真実', 'ヨコオ　マミ', '113821'),
(2540101, 'S1A1', '有馬　絢菜', 'アリマ　アヤナ', '742553'),
(2540102, 'S1A1', '織田　真里', 'オダ　マリ', '218920'),
(2540103, 'S1A1', '小山　真司', 'オヤマ　シンジ', '307977'),
(2540104, 'S1A1', '鬼頭　睦美', 'キトウ　ムツミ', '207684'),
(2540105, 'S1A1', '嶋田　美憲', 'シマダ　ミノリ', '865651'),
(2540106, 'S1A1', '島袋　裕美', 'シマブクロ　ヒロミ', '576904'),
(2540107, 'S1A1', '高尾　平吉', 'タカオ　ヘイキチ', '408033'),
(2540108, 'S1A1', '水野　靖', 'ミズノ　ヤスシ', '576594'),
(2540109, 'S1A1', '安川　翠', 'ヤスカワ　ミドリ', '759936'),
(2540110, 'S1A1', '山川　芳太郎', 'ヤマカワ　ヨシタロウ', '305195');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `detail`
--
ALTER TABLE `detail`
  ADD PRIMARY KEY (`d_id`);

--
-- テーブルのインデックス `item`
--
ALTER TABLE `item`
  ADD PRIMARY KEY (`i_id`);

--
-- テーブルのインデックス `reserve`
--
ALTER TABLE `reserve`
  ADD PRIMARY KEY (`r_id`);

--
-- テーブルのインデックス `sales`
--
ALTER TABLE `sales`
  ADD PRIMARY KEY (`s_id`);

--
-- テーブルのインデックス `shopitem`
--
ALTER TABLE `shopitem`
  ADD PRIMARY KEY (`s_id`);

--
-- テーブルのインデックス `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`st_id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `detail`
--
ALTER TABLE `detail`
  MODIFY `d_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- テーブルの AUTO_INCREMENT `item`
--
ALTER TABLE `item`
  MODIFY `i_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- テーブルの AUTO_INCREMENT `reserve`
--
ALTER TABLE `reserve`
  MODIFY `r_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- テーブルの AUTO_INCREMENT `sales`
--
ALTER TABLE `sales`
  MODIFY `s_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- テーブルの AUTO_INCREMENT `shopitem`
--
ALTER TABLE `shopitem`
  MODIFY `s_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- テーブルの AUTO_INCREMENT `student`
--
ALTER TABLE `student`
  MODIFY `st_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2540111;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
